{"data":{"sitePage":{"id":"SitePage /","path":"/","context":{"centerpiece":{"abstract":"<p>Penn men’s basketball defeated Columbia by a score of 76-67 on Saturday afternoon. While the Red and Blue beat the Lions by nine points, it was a close game throughout, with the Quakers pulling away in the last few minutes.&nbsp;</p>","content":"<p>NEW YORK — The Quakers seem to have a knack for winning close games.&nbsp;</p>\n<p>Penn men’s basketball defeated Columbia by a score of 76-67 on Saturday afternoon. While the Red and Blue (11-7, 3-2 Ivy) beat the Lions (6-15, 1-4) by nine points, it was a close game throughout, with the Quakers pulling away in the last few minutes.&nbsp;</p>\n<p>The most notable moment of the game might have come in the middle of the second half, when senior guard Ryan Betley suffered an injury around his left ankle. It is too early to know his timetable for recovery, but the injury could be a major blow for the Quakers if it takes him off the court long-term. Betley has been enjoying an impressive season after suffering a season-ending injury in the first game of the 2018-19 season.&nbsp;</p>\n<p>With Betley off the court, the Quakers were able to find success in a tight late-game situation. Senior forward AJ Brodeur was the focal point of their offensive attack, leading both teams with 24 points. While Penn’s offense has flowed through Brodeur for years, the Quakers needed to rely even more on him and senior guard Devon Goodman, who scored 16 points, in Betley's absence.&nbsp;</p>\n<p>”They‘ve both been through us without this thing … and they’re just so committed to winning,” coach Steve Donahue said. “They do it every day, they don’t miss practices, they’ll do whatever is asked. Both guys are confident to make plays down the stretch, and we’re going to miss them [when they graduate]. They’re everything you want in a Penn basketball player.”</p>\n<p>The strong chemistry between the two seniors was exemplified throughout the game, as Brodeur found Goodman for several wide-open layups on cuts to the basket throughout the contest, which powered the Red and Blue's offense and allowed them to fend off a hungry Columbia team coming off four straight losses.&nbsp;</p>\n<p>“We’re in the same class, and we’ve been friends since we got here,“ Brodeur said. “He’s our point guard; we trust him completely. You always know what to expect from him.“</p>\n<p>The first half was very much a back and forth fight, with neither team ever taking a double-digit lead. At halftime, both teams entered the locker rooms having scored 31 points.&nbsp;</p>\n<p>After the Quakers went up by 10 points at one point in the second half, the Lions got within one point with only a few minutes remaining before Penn put them away.&nbsp;</p>\n<p>Throughout the game, Columbia employed an up-tempo offense with quick ball movement and frequently attempted mid-range jump shots. This style of play was markedly different from Penn’s, which almost exclusively takes three-pointers and shots inside the paint.&nbsp;</p>\n<p>The Lions gave the Quakers a heavy dose of senior guard Mike Smith. Although he finished with a team-high 21 points, the Quakers’ defense was able to hold him relatively in check, as he shot just 36.4% from the field for the game.</p>\n<p>“I thought we made him a volume scorer. That’s all you can do with a kid who has the ball in his hands that much,” Donahue said.&nbsp;</p>\n<p>After being out of the lineup for a few games earlier this season, junior guard Eddie Scott has begun to contribute heavily in the Quakers’ recent wins. That was no different on Saturday, as he provided a spark off the bench with eight points on 4-of-4 shooting. During one sequence in the second half, he recorded two breakaway dunks in the span of about 10 seconds, the second a double-clutch slam that ignited the Penn fans in attendance and forced Columbia to call a timeout.&nbsp;</p>\n<p>“I saw their center at the top of the key just holding the ball and not paying attention to who was behind him, so I figured I’d just go ahead and tap it out of his hands from behind the back,” Scott said about the second dunk. “I was just trying to get my team hyped, yell at my team, yell at the crowd, and just give us that energy that we needed.”</p>\n<p>The biggest highlight of the game, however, was when freshman guard Jordan Dingle connected with AJ Brodeur for a fast-break alley-oop dunk. The play helped fuel a second half resurgence that ultimately won Penn the game.</p>\n<p>Even though this game was played 88 miles from the Palestra, the Penn fans in attendance made sure their voices were heard. In a city where many Penn students work after graduation, the alumni presence was strong in Levien Gymnasium.&nbsp;</p>\n<p>The game was originally scheduled for Friday at 7 p.m. but was postponed to Saturday due to inclement weather in upstate New York that affected Cornell and forced the Ivy League to reschedule four games. As a result, Penn will play a rare Sunday Ivy League game against the Big Red (5-13, 2-3 Ivy) in Ithaca, N.Y., where they will look to stay hot against a competitive Cornell team.&nbsp;</p>","dominantMedia":{"content":"","attachment_uuid":"b31a361b-6a31-4165-9300-62c6ccd270be"},"headline":"Penn men's basketball defeats Columbia, 76-67, in tight Saturday afternoon contest","subhead":"Senior Ryan Betley went down with an apparent ankle injury in the second half"},"topArticles":[{"abstract":"<p>Penn men's and women's basketball are gearing up for another weekend full of Ivy League basketball as the Quakers face Columbia and Cornell.</p>","content":"<p>Penn men's and women's basketball are gearing up for another weekend full of Ivy League basketball as the Quakers face Columbia and Cornell. The women tip off Friday night at the Palestra, while the men will play Saturday at 2 p.m. in New York City after a weather delay forced the game to be pushed back.</p>\n<p>Check out our weekend previews for the <a href=\"https://www.thedp.com/article/2020/02/penn-mens-basketball-ivy-league-columbia-cornell-preview\" target=\"_blank\">men</a> and <a href=\"https://www.thedp.com/article/2020/02/penn-womens-basketball-columbia-cornell-preview-ivy-league\" target=\"_blank\">women</a>.</p>\n<p>Get to know one of women's basketball's best secret weapons: <a href=\"https://www.thedp.com/article/2020/02/penn-womens-basketball-emily-anderson-profile-ivy-league-kendall-grasela\" target=\"_blank\">Emily Anderson</a>.</p>\n<p>Most fans know men's head coach Steve Donahue, but what about his <a href=\"https://www.thedp.com/article/2020/02/penn-mens-basketball-assistant-coaches-graham-mihalich-montgomery\" target=\"_blank\">trio of assistants</a>?</p>\n<hr />\n<p><br></p>\n<div class=\"embed\"><a class=\"twitter-timeline\" href=\"https://twitter.com/DailyPennSports/timelines/1225862860858777600?ref_src=twsrc%5Etfw\">MBB/WBB vs. Columbia - Curated tweets by DailyPennSports</a> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n</div>","dominantMedia":{"attachment_uuid":"96cab2cf-d24c-469a-a593-bf509da3a80a","content":"<p>Penn men's basketball will face Columbia on Saturday after its game was moved back, but the women will tip off against the Lions Friday night.</p>"},"headline":"Live Blog: Penn basketball versus Columbia","subhead":"The men take on the Lions in a postponed Saturday contest"},{"abstract":"<p>Penn V-Day's board, also known as V-Board, decided to replace the Vagina Monologues in Spring 2018 to showcase a more inclusive production not centered around the female anatomy.</p>","content":"<p>Penn Monologues will<strong> </strong>replace the Vagina Monologues for Penn V-Day’s annual production in late February.</p>\n<p>Penn V-Day's board, also known as V-Board, decided, in spring 2018, to replace the Vagina Monologues to showcase a more inclusive production not centered around the female anatomy, V-Day Workshop Director and College senior Briar Essex<strong> </strong>said.&nbsp;</p>\n<p>This year’s show will include 23 original monologues on topics including sexual assault, identity, and gender-based violence written and performed by Penn community members<strong>. </strong>The production will feature different forms of work alongside traditional monologues, such as audio recording, dance, songs, and poetry.&nbsp;</p>\n<p>Penn V-Day is part of a <a href=\"https://www.vday.org/about/why-vday-started.html\" target=\"_blank\">national organization</a> that aims to end violence against women and girls. They produce a performance of the Vagina Monologues each February and donate the proceeds to local projects or organizations that work to end violence against women.&nbsp;</p>\n<p>The <a href=\"https://www.eveensler.org/plays/the-vagina-monologues/\" target=\"_blank\">Vagina Monologues</a> is a play<strong> </strong>written by Eve Ensler in 1996 that <a href=\"http://\" target=\"_self\">addresses </a>women's sexuality and the stigma around sexual violence. The play consists of 27 monologues based on the experiences of over 200 women, Essex said. V-Board found Ensler’s script to be outdated and decided to replace the Vagina Monologues with original monologues, Essex added.</p>\n<p>The Penn Monologues feature original monologues based on student experiences, as opposed to performing Ensler's play verbatim.</p>\n<p>Essex said that the Vagina Monologues promotes a particular form of womanhood which equates being a woman to having a vagina.</p>\n<p>“[The Vagina Monologues] erases the identity of women without vaginas or people who have vaginas and aren’t women,” Essex said. “But it also erases the fact that a lot of people find empowerment in a lot of other ways.”</p>\n<p>Essex added that the Vagina Monologues did not \"make space\" for women of color and trans people.</p>\n<img class=\"media-embed\" data-embedded-media=\"954d70dc-13c0-4951-8d2f-d3adf224ee8f\" data-uuid=\"954d70dc-13c0-4951-8d2f-d3adf224ee8f\" data-link-to=\"\" src=\"https://s3.amazonaws.com/snwceomedia/dpn/47fed1d5-226a-4c0d-8a9f-c596b2c8cd68.sized-1000x1000.jpg\" data-width=\"788.40625\" data-height=\"525.46875\" data-align=\"\" />\n<p>“Now, the people making it happen at Penn are a Black woman and a trans person,” Essex said, referring to themselves and V-Day Artistic Director and College senior Mckayla Warwick. “The original conceivers of the [Vagina Monologues] could not have conceived the two of us ever doing it.”</p>\n<p>Penn Monologues began in 2010 and was <a href=\"https://www.thedp.com/article/2016/04/penn-monologues\" target=\"_blank\">last performed</a> in 2017 because the show required \"so much work,\" Essex said, based on a conversation with former Penn Violence Prevention Director Jessica Mertz.</p>\n<p>Before deciding to put on Penn Monologues, Essex said that V-Board considered putting on a “split-show” in which Ensler’s Vagina Monologues was followed by a number of original monologues from the Penn community. V-Day Executive Chair and College senior Olivia Bridges added that the University of California at Berkeley produced a similar show in 2018, following Ensler’s script with a production called <a href=\"https://www.dailycal.org/2019/03/18/our-monologues-showcase-inclusivity/\">“Our Monologues.”</a></p>\n<p>Following the performance, Essex said that V-Day International and Ensler asked the students not to alter the performance again by adding the original monologues. Because this altered show could potentially hurt the longevity of V-Day at Penn, Essex said the board decided against performing both Vagina Monologues and original monologues.</p>\n<p>College senior Claire Huffman is performing an original monologue that combines a critique of the Vagina Monologues with personal experiences.</p>\n<p>“I think it’s more interesting to get first hand stories from individuals that [you do] not necessarily know but go to the same school and have similar experiences,” Huffman.</p>\n<img class=\"media-embed\" data-embedded-media=\"d95e8a4a-3382-4058-8ba2-b167478bce6e\" data-uuid=\"d95e8a4a-3382-4058-8ba2-b167478bce6e\" data-link-to=\"\" src=\"https://s3.amazonaws.com/snwceomedia/dpn/949ba44e-11c1-4e1c-a750-3587fe31c7d8.sized-1000x1000.jpg\" data-width=\"788.40625\" data-height=\"525.46875\" data-align=\"\" />\n<p>Last year, V-Day held monthly open mic nights for content creators to share experiences around gender-based violence, sexual violence, sexuality, and other themes that V-Day brings awareness to on campus, Bridges said.</p>\n<p>Bridges, Essex, and Warwick said the replacement of the Vagina Monologues has given them more autonomy over the show. Bridges added that this year when they were looking for submissions, they encouraged submissions in whatever format the writer felt was most appropriate to tell their story.&nbsp;</p>\n<p>Warwick added that the show is organized in a more narrative arc that begins with some lighter pieces and ends with healing, as opposed to the Vagina Monologues which Essex likened to “whiplash” because of its emphasis on shock value.&nbsp;</p>\n<p>The show will include a content warning and allow time for audience members to leave the room, as some monologues will describe writers’ experiences with sexual assault, particularly on Penn’s campus, Warwick said.</p>\n<p>In the last 20 years, V-Day has formed a close relationship with the<a href=\"https://www.woar.org\" target=\"_blank\"> Philadelphia Center Against Sexual Violence</a>, formally known as Women Organized Against Rape, and raised over $200,000 for the organization, Bridges said. Bridges added that the timing of the switch to the Penn Monologues coincidentally aligned with WOAR’s name change, as both groups looked to become more inclusive.&nbsp;</p>\n<p>V-Day will continue to donate their proceeds from the Penn Monologues and other efforts on campus including a fashion show, 24-hour radio marathon, and profit-share at Kiwi to WOAR.</p>\n<p><a href=\"https://phillyfunguide.com/theatre/upenn-penn-v-day-presents-the-penn-monologues\">Penn Monologues</a> will take place Thursday Feb. 20, Friday Feb. 21, and Saturday Feb. 22 at 7pm. The Thursday and Friday performances will be in the ARCH Auditorium and the Saturday performance will be at The Rotunda. V-Day will also host a \"talk back\" on Sunday, March 1 where community members can share their feedback on the show.</p>","dominantMedia":{"attachment_uuid":"a71cd86b-baf4-4c7e-b0fb-e28f6e7ac8e8","content":"Penn Monologues will be a more inclusive production that doesn’t center around the female anatomy."},"headline":"Penn Monologues will replace annual Vagina Monologues event to promote inclusivity ","subhead":null}]}}}}