{"data":{"sitePage":{"id":"SitePage /","path":"/","context":{"centerpiece":{"abstract":"<p>Capping off a successful weekend trip to the Empire State, Penn men’s basketball won its fifth straight game with a rollercoaster 79-73 win over Cornell.</p>","content":"<p>Sometimes good things come in fives.</p>\n<p>Capping off a successful weekend trip to the Empire State, Penn men’s basketball won its fifth straight game with a rollercoaster 79-73 win over Cornell. In a truly wild game, the Quakers (12-7, 4-2 Ivy) and Big Red (5-14, 2-4) had 10 ties and 12 lead changes.&nbsp;</p>\n<p>The Red and Blue continued a recent trend of winning games by playing well down the stretch. Their win today could end up being crucial when seeds are determined for the Ivy League Tournament.</p>\n<p>The Quakers had their hands full all game long, as Cornell’s three-headed monster of senior Josh Warren and juniors Jimmy Boeheim and Terrance McBride scored 51 of the Big Red’s 73 points.</p>\n<p>Warren seemed incapable of missing a three-point shot, as he made five of his six attempts from deep and finished with 23 points.</p>\n<p>\"He was unbelievable, it’s really difficult to guard guys that can shoot like that, and he made us pay [when we contested him],\" said Penn coach Steve Donahue.</p>\n<p>&nbsp;Meanwhile, Boeheim, the son of legendary Syracuse coach Jim Boeheim, was unguardable at times, but he went just 1-for-6 from behind the arc.</p>\n<p>One of the most memorable moments of the afternoon occurred with around a minute remaining when senior forward AJ Brodeur connected with junior guard Eddie Scott, who threw down an emphatic alley-oop dunk to put Penn up six. Scott has proven to be an exciting player to watch, as he had two dunks for the second consecutive game.&nbsp;</p>\n<p>Less than 30 seconds of game time later, Brodeur blocked a pivotal three-point attempt, which was critical for the Quakers’ win. Brodeur was just one rebound of two assists short of a triple-double.&nbsp;</p>\n<p>“It was big to have a lot of guys score in a lot of different ways, and to get it done defensively, especially when we’re on the road. We really showed our toughness today,\" said Brodeur. \"We’re capable of getting leads, maintaining leads, and coming back.”</p>\n<p>Playing without senior guard Ryan Betley, who did not travel with the team after suffering an injury against Columbia, fellow senior Ray Jerome took his spot in the starting lineup. While Jerome did a serviceable job in Betley’s place, but it was a pair of freshmen who really stepped up.&nbsp;</p>\n<p>Guard Jordan Dingle and forward Max Martz both finished with 17 points to tie for Penn's second leading scorer behind senior guard Devon Goodman, who scored 18.</p>\n<p>“[The freshmen] were terrific, and Max in particular, for him to be another scorer stretches the defense. And then Lucas Monroe gave us great minutes,\" Donahue said. \"We’re going to need them down the stretch if we’re going to win a championship.”</p>\n<p>In a wild first half, both teams went on 8-0 runs and shot over 40% from beyond the arc, with the Quakers ultimately going into the locker room up 38-35.</p>\n<p>The second half was not much different from the first, with both teams playing well on offense throughout. However, it was the Quakers’ defense late that made the difference, preventing the Big Red from making a comeback.&nbsp;</p>\n<p>“Not having [Betley] was a huge loss for us for sure, but I think we showed a little extra grit and a little more toughness playing without that weapon that we usually have,\" Brodeur said. \"I thought a lot of us, especially the young guys, responded well to that adversity.”</p>\n<p>As has been the case many times this season, Goodman was responsible for much of Penn’s success. Although he missed a few critical layups late in the game, he spread the ball around all afternoon and made several contested shots. Goodman has scored in double-figures in 15 of his last 17 games.&nbsp;</p>\n<p>The trip to Newman Arena was a homecoming of sorts for Donahue, who coached the Big Red for 10 seasons, leading them to three consecutive NCAA Tournament berths, including a magical run to the Sweet 16 in 2010.&nbsp;</p>\n<p>As a result of inclement weather in upstate New York on Friday, the game was played on Sunday as opposed to Saturday, when it was originally scheduled. While this delay gave Penn fans a unique opportunity to watch an Ivy League basketball game on a Sunday, it will give the Quakers a short week to prepare for another important Ivy League game against Brown (11-8, 4-2) on Friday night at the Palestra, where Penn will try for its sixth straight win.&nbsp;</p>","dominantMedia":{"content":"<p>Junior forward AJ Brodeur had a combined 59 points when Penn men's basketball played Dartmouth and Harvard in a home weekend series earlier this season.</p>","attachment_uuid":"4244262f-7889-481b-b297-9bf16f84060e"},"headline":"Penn men's basketball defeats Cornell, 79-73, for fifth straight win","subhead":"The Quakers received key contributions from a pair of freshmen"},"topArticles":[{"abstract":"<p>Senior Phoebe Sterba helped lead the Quakers to a 63-41 win against Cornell. The Red and Blue have now won three games in a row and are above .500 in conference play.</p>","content":"<p>It’s usually difficult to play with fatigue, but not for Penn women’s basketball.&nbsp;</p>\n<p>Friday night, it was junior center Eleah Parker who led Penn to an overtime win. Saturday night, it was senior guard Phoebe Sterba. Sterba helped lead the Quakers to a 63-41 win at the Palestra against Cornell. The Red and Blue have now won three games in a row and are above .500 in conference play.</p>\n<p>Back-to-back game nights are physically draining for players, even more so following an overtime game the night before. At times in the first quarter, it was evident that the two games were taking a toll on Penn (13-5, 3-2 Ivy). However, that fatigue was quickly replaced by aggressiveness as their offense got going.&nbsp;</p>\n<p>“We were physically fatigued from last night,” coach Mike McLaughlin said. “I just wanted them to play as hard as they could, even if they were short runs. I didn’t want to slow the game down; I wanted them to go fast.”</p>\n<p>While the physicality required to play is one thing, McLaughlin was also impressed by the mental fortitude his team showed to come out again and play the way they did.&nbsp;</p>\n<p>From the very beginning, the Quakers' fast-paced play paid off on the offensive and defensive end. It was clear that Cornell (9-9, 2-4) was uncomfortable with the pace of play, and Penn was able to force 13 turnovers. The Quakers were then able to turn those into 15 points.</p>\n<p>Sterba opened up the game with a three-pointer on the first possession of the game, going on to drain six treys in total. With that performance, she moved into a tie for fourth on Penn’s all-time career three-pointers list with 165. Meanwhile, she led all scorers with 22 points and was one point shy of her career-best.&nbsp;</p>\n<p>“It definitely feels good to get the first ones in, and it also really helps to open the floor for other teammates,” Sterba said. “It doesn’t only help me, but it also helps my teammates, which is really good too because we have really good scorers on our team.”</p>\n<img class=\"media-embed\" data-embedded-media=\"0ec9a5a9-5f69-49fa-ad01-e7eb4eb5a05f\" data-uuid=\"0ec9a5a9-5f69-49fa-ad01-e7eb4eb5a05f\" data-link-to=\"\" src=\"https://s3.amazonaws.com/snwceomedia/dpn/432c052e-8e11-4f1f-abeb-f65e6f530aaa.sized-1000x1000.jpg\" data-width=\"0\" data-height=\"0\" data-align=\"\" />\n<p>While Sterba highlighted the offensive play for the Red and Blue, several players had dominant games to help drive Penn’s offense. Parker followed up her career night with another dominant game, tallying 13 points, eight rebounds and four blocks. Meanwhile, junior forward Tori Crawford was one rebound shy from a double-double, with nine boards and 10 points.</p>\n<p>Senior guard Kendall Grasela only tallied six points, but her presence was definitely felt on the court. The co-captain had an all-around game, grabbing four rebounds, three steals, and four assists. At the 7:24 mark in the second quarter, Grasela showed off her dribbling skills as she smoothly dribbled between defenders, putting in the layup and drawing a foul.</p>\n<p>“Kendall really did a heck of a job to get us started,” McLaughlin said. “I think that was one of her better performances on both ends of the floor in a really long time.”</p>\n<p>Getting to the free-throw line was a big part of Penn’s game on Saturday. Not only were they able to get to the line, they were also successful from it. The Quakers had 19 shots from the charity stripe, making 14 of them.</p>\n<p>While the offense for Penn flourished, their defense was able to keep the Big Red off balance and force bad shots. Most importantly, they were able to keep Cornell’s top two scorers this season, senior forward Laura Bagwell-Katalinich and senior guard Samantha Widmann, to a combined 14 points.</p>\n<p>The Red and Blue will look to keep the good times rolling on the road next weekend when they face off with Brown and Yale.&nbsp;</p>","dominantMedia":{"attachment_uuid":"5597d9cd-c223-42ee-9ad5-35dadef09a12","content":"<p>Senior guard Phoebe Sterba finished the night with 22 points, including 18 from beyond the arc.</p>"},"headline":"Penn women's basketball dominates Cornell, 63-41, for Ivy Weekend sweep","subhead":"Senior Phoebe Sterba drained six threes for the Quakers"},{"abstract":"<p>Penn men’s basketball won its fourth consecutive game on Saturday afternoon. Here’s what we learned from the Red and Blue’s tight win.&nbsp;</p>","content":"<p>Penn men’s basketball won its fourth consecutive game (and third in Ivy League play) with a 76-67 victory over Columbia on Saturday afternoon. Here’s what we learned from the Red and Blue’s tight win.&nbsp;</p>\n<p>1. Senior guard <a href=\"https://www.thedp.com/article/2020/02/penn-mens-basketball-senior-class-aj-brodeur-ray-jerome-devon-goodman-ryan-betley\" target=\"_blank\">Ryan Betley</a> went down with an apparent ankle injury in the second half and did not return to the game. Betley won’t play in Penn’s Sunday contest against Cornell, and it’s unclear if and when he would be able to return to action after that.&nbsp;</p>\n<p>2. The major question mark that Penn faces is how the team could perform if Betley misses significant time or isn’t able to play at all again this season. The Quakers had to deal with a similar situation when Betley went down with a season-ending injury in the first game of 2018-19, but that team had experienced guards like Antonio Woods and Jake Silpe who were able to start and play significant minutes. This year’s backcourt group is filled with freshmen, albeit talented ones.</p>\n<p>3. While not listed as a guard, freshman forward Max Martz might have to be the player to fill Betley’s role down the stretch if he remains unavailable. Martz made three key three-pointers in the second half to extend Penn’s lead when the Quakers were receiving little other outside shooting. He has also racked up a very impressive 50% mark from beyond the arc so far this season. While Martz still has some work to do to reach Betley’s level in terms of cuts and drives to the basket, it might not be too far-fetched to see him start consistently scoring in double-digits with more minutes.</p>\n<p>4. A couple of other names to watch moving forward are freshman guard Lucas Monroe and sophomore guard Bryce Washington, who combined to play only three minutes on Saturday. If Betley misses significant time, or even if he is able to return quickly, these two players could provide important guard depth as the Quakers move through the Ivy Weekend slate. Monroe has been a solid rebounder and defender during his rookie season, and Washington could provide some big three-pointers off the bench. It’s unclear how much Washington will play, however, as he just returned to warmups before the Columbia game for the first time since suffering a wrist injury, and he wasn’t even receiving all that many minutes before the injury.</p>\n<p>5. In the first half of Saturday’s game, Columbia double-teamed senior forward AJ Brodeur on several occasions. That strategy seemed to be working pretty well, as it gave Brodeur no room to operate in the paint and forced him to kick the ball outside to Penn’s struggling shooters. Then the Lions inexplicably stopped the double-teams for the most part in the second half, and the big man dominated on the way to a game-high 24 points. It will be interesting to see if other Ivy League teams start doing the same and collapse into the paint to try to stop Brodeur. If they do, Penn’s three-point shooting will become even more important.&nbsp;</p>\n<p>6. Brodeur had struggled somewhat from the foul line going into this season, with mark of 57.6% from the charity stripe in 2018-19, but he has been much improved this year. He currently is shooting 75% from the line, and he made 10-of-12 free throws in Saturday’s game. If Brodeur keeps that up, he will be nearly impossible to guard, as teams often resort to fouling him inside to avoid giving up easy buckets.</p>\n<p>7. Penn’s defense has been very effective over its four-game winning streak, and that continued for the most part against Columbia. Despite that, coach <a href=\"https://www.thedp.com/article/2020/01/penn-mens-basketball-offense-strategy-donahue-brodeur\" target=\"_blank\">Steve Donahue</a> did make note of a few plays in the second half where the Quakers overcommitted into the paint and gave up open threes. Three-point defense has always been one of Donahue’s points of emphasis, and continuing to force contested twos, as the Quakers did for much of Saturday’s game, will be key in limiting Ivy League opponents.</p>","dominantMedia":{"attachment_uuid":"b1ddb290-2d23-4ee0-af46-8a7a78ec3796","content":""},"headline":"Notebook: Seven things we learned from the Quakers' win over Columbia","subhead":"The Quakers will need someone to step up in Ryan Betley's absence"},{"abstract":"<p>Penn V-Day's board, also known as V-Board, decided to replace the Vagina Monologues in Spring 2018 to showcase a more inclusive production not centered around the female anatomy.</p>","content":"<p>Penn Monologues will<strong> </strong>replace the Vagina Monologues for Penn V-Day’s annual production in late February.</p>\n<p>Penn V-Day's board, also known as V-Board, decided, in spring 2018, to replace the Vagina Monologues to showcase a more inclusive production not centered around the cis female experience, V-Day Workshop Director and College senior Briar Essex<strong> </strong>said.&nbsp;</p>\n<p>This year’s show will include 23 original monologues on topics including sexual assault, identity, and gender-based violence written and performed by Penn community members<strong>. </strong>The production will feature different forms of work alongside traditional monologues, such as audio recording, dance, songs, and poetry.&nbsp;</p>\n<p>Penn V-Day is part of a <a href=\"https://www.vday.org/about/why-vday-started.html\" target=\"_blank\">national organization</a> that aims to end violence against women and girls. They produce a performance of the Vagina Monologues each February and donate the proceeds to local projects or organizations that work to end violence against women.&nbsp;</p>\n<p>The <a href=\"https://www.eveensler.org/plays/the-vagina-monologues/\" target=\"_blank\">Vagina Monologues</a> is a play<strong> </strong>written by Eve Ensler in 1996 that <a href=\"http://\" target=\"_self\">addresses </a>women's sexuality and the stigma around sexual violence. The play consists of 27 monologues based on the experiences of over 200 women, Essex said. V-Board found Ensler’s script to be outdated and decided to replace the Vagina Monologues with original monologues, Essex added.</p>\n<p>The Penn Monologues feature original monologues based on student experiences, as opposed to performing Ensler's play verbatim.</p>\n<p>Essex said that the Vagina Monologues promotes a particular form of womanhood which equates being a woman to having a vagina.</p>\n<p>“[The Vagina Monologues] erases the identity of women without vaginas or people who have vaginas and aren’t women,” Essex said. “But it also erases the fact that a lot of people find empowerment in a lot of other ways.”</p>\n<p>Essex added that the Vagina Monologues did not \"make space\" for women of color and trans people.</p>\n<img class=\"media-embed\" data-embedded-media=\"954d70dc-13c0-4951-8d2f-d3adf224ee8f\" data-uuid=\"954d70dc-13c0-4951-8d2f-d3adf224ee8f\" data-link-to=\"\" src=\"https://s3.amazonaws.com/snwceomedia/dpn/47fed1d5-226a-4c0d-8a9f-c596b2c8cd68.sized-1000x1000.jpg\" data-width=\"788.40625\" data-height=\"525.46875\" data-align=\"\" />\n<p>“Now, the people making it happen at Penn are a Black woman and a trans person,” Essex said, referring to themselves and V-Day Artistic Director and College senior Mckayla Warwick. “The original conceivers of the [Vagina Monologues] could not have conceived the two of us ever doing it.”</p>\n<p>Penn Monologues began in 2010 and was <a href=\"https://www.thedp.com/article/2016/04/penn-monologues\" target=\"_blank\">last performed</a> in 2017 because the show required \"so much work,\" Essex said, based on a conversation with former Penn Violence Prevention Director Jessica Mertz.</p>\n<p>Before deciding to put on Penn Monologues, Essex said that V-Board considered putting on a “split-show” in which Ensler’s Vagina Monologues was followed by a number of original monologues from the Penn community. V-Day Executive Chair and College senior Olivia Bridges added that the University of California at Berkeley produced a similar show in 2018, following Ensler’s script with a production called <a href=\"https://www.dailycal.org/2019/03/18/our-monologues-showcase-inclusivity/\">“Our Monologues.”</a></p>\n<p>Following the performance, Essex said that V-Day International and Ensler asked the students not to alter the performance again by adding the original monologues. Because this altered show could potentially hurt the longevity of V-Day at Penn, Essex said the board decided against performing both Vagina Monologues and original monologues.</p>\n<p>College senior Claire Huffman is performing an original monologue that combines a critique of the Vagina Monologues with personal experiences.</p>\n<p>“I think it’s more interesting to get first hand stories from individuals that [you do] not necessarily know but go to the same school and have similar experiences,” Huffman.</p>\n<img class=\"media-embed\" data-embedded-media=\"d95e8a4a-3382-4058-8ba2-b167478bce6e\" data-uuid=\"d95e8a4a-3382-4058-8ba2-b167478bce6e\" data-link-to=\"\" src=\"https://s3.amazonaws.com/snwceomedia/dpn/949ba44e-11c1-4e1c-a750-3587fe31c7d8.sized-1000x1000.jpg\" data-width=\"788.40625\" data-height=\"525.46875\" data-align=\"\" />\n<p>Last year, V-Day held monthly open mic nights for content creators to share experiences around gender-based violence, sexual violence, sexuality, and other themes that V-Day brings awareness to on campus, Bridges said.</p>\n<p>Bridges, Essex, and Warwick said the replacement of the Vagina Monologues has given them more autonomy over the show. Bridges added that this year when they were looking for submissions, they encouraged submissions in whatever format the writer felt was most appropriate to tell their story.&nbsp;</p>\n<p>Warwick added that the show is organized in a more narrative arc that begins with some lighter pieces and ends with healing, as opposed to the Vagina Monologues which Essex likened to “whiplash” because of its emphasis on shock value.&nbsp;</p>\n<p>The show will include a content warning and allow time for audience members to leave the room, as some monologues will describe writers’ experiences with sexual assault, particularly on Penn’s campus, Warwick said.</p>\n<p>In the last 20 years, V-Day has formed a close relationship with the<a href=\"https://www.woar.org\" target=\"_blank\"> Philadelphia Center Against Sexual Violence</a>, formally known as Women Organized Against Rape, and raised over $200,000 for the organization, Bridges said. Bridges added that the timing of the switch to the Penn Monologues coincidentally aligned with WOAR’s name change, as both groups looked to become more inclusive.&nbsp;</p>\n<p>V-Day will continue to donate their proceeds from the Penn Monologues and other efforts on campus including a fashion show, 24-hour radio marathon, and profit-share at Kiwi to WOAR.</p>\n<p><a href=\"https://phillyfunguide.com/theatre/upenn-penn-v-day-presents-the-penn-monologues\">Penn Monologues</a> will take place Thursday Feb. 20, Friday Feb. 21, and Saturday Feb. 22 at 7pm. The Thursday and Friday performances will be in the ARCH Auditorium and the Saturday performance will be at The Rotunda. V-Day will also host a \"talk back\" on Sunday, March 1 where community members can share their feedback on the show.</p>","dominantMedia":{"attachment_uuid":"a71cd86b-baf4-4c7e-b0fb-e28f6e7ac8e8","content":"<p>Penn Monologues will be a more inclusive production that doesn’t center around the cis female experience.</p>"},"headline":"Penn Monologues will replace annual Vagina Monologues event to promote inclusivity ","subhead":null}],"mostReadDP":[{"path":"/article/2020/02/coronavirus-wuhan-penn-students-travel-trump-ban","image":"https://snworksceo.imgix.net/dpn/b032b62a-36b1-446d-9a11-8e0d35230862.sized-1000x1000.png?w=800","ogTitle":"Penn student stranded in Wuhan says coronavirus outbreak is &#39;like a zombie apocalypse&#39;"},{"path":"/article/2020/02/upenn-bernie-sanders-2020-politics-daily-pennsylvanian","image":"https://snworksceo.imgix.net/dpn/d851148b-a33d-4799-93d5-2295fb309ab6.sized-1000x1000.jpg?w=800","ogTitle":"Editorial | Bernie Sanders is the best candidate to defeat Trump"},{"path":"/article/2020/02/penn-iaa-model-un-osa-shut-down","image":"https://snworksceo.imgix.net/dpn/9e04021b-0361-43e4-87fa-5e4ed8a5f9c9.sized-1000x1000.png?w=800","ogTitle":"International Affairs Association suspended, loses registration with Penn"},{"path":"/article/2020/02/penn-volleyball-what-we-know-and-dont-know","image":"https://snworksceo.imgix.net/dpn/d9b738c6-fef9-4758-8fee-7392b5fffa8c.sized-1000x1000.jpg?w=800","ogTitle":"What we know and what we don&#39;t know about the state of Penn volleyball"},{"path":"/article/2020/02/alfredo-pratico-bon-appetit-upenn-dining","image":"https://snworksceo.imgix.net/dpn/30acc360-c44d-49d8-99fa-ff9bce77e656.sized-1000x1000.jpg?w=800","ogTitle":"Alfredo Pratic&#242; | Penn must reevaluate its relationship with Bon App&#233;tit"}],"mostRead34":[{"path":"/article/2020/02/sophie-shen-artist-paint-watercolor-sydney-australia-etsy-custom-shoes-jackets-textiles-graphic-design-student-wharton","image":"https://snworksceo.imgix.net/dpn-34s/8587d08b-d4b2-4148-b4c3-b91ed67a1552.sized-1000x1000.JPG?w=800","ogTitle":"Meet Sophie Shen, the Wharton Sophomore Who Will Paint on Anything"},{"path":"/article/2020/02/tiktok-austin-maguire-social-media-vine-upenn-ivy-league","image":"https://snworksceo.imgix.net/dpn-34s/85d4041d-726f-4050-ad7d-e0519f2f5f50.sized-1000x1000.jpg?w=800","ogTitle":"Austin Maguire on the highs and lows of TikTok stardom"},{"path":"/article/2020/02/toni-rinaldi-glee-club-gettysburg-upenn-ivy-league-ego-of-the-week","image":"https://snworksceo.imgix.net/dpn-34s/bde83b97-6f48-48d4-9e27-96977e90c632.sized-1000x1000.png?w=800","ogTitle":"Ego of the Week&#58; Toni Rinaldi"}],"mostReadUTB":[{"path":"/article/2020/02/penn-suspends-iaa-hazing","image":"https://snworksceo.imgix.net/dpn-utb/343c70c1-48ba-4d55-80fe-0c321fa56d6d.sized-1000x1000.jpg?w=800","ogTitle":"BREAKING&#58; Penn Finally Brings Down the IAA, the Only Group on Campus That Does Hazing of Any Kind "},{"path":"/article/2020/02/mckinsey-self-proclaimed-communist","image":"https://snworksceo.imgix.net/dpn-utb/d2329a88-eb23-430a-bc11-81b6dd85cf61.sized-1000x1000.jpg?w=800","ogTitle":"Meet the Self-Proclaimed Communist Working at McKinsey Next Year"},{"path":"/article/2020/02/girl-bullet-journals-daily-freak-bed","image":"https://snworksceo.imgix.net/dpn-utb/55d449ec-5c69-4e7a-8adf-00062e40a676.sized-1000x1000.jpg?w=800","ogTitle":"Girl Who Bullet Journals Daily Actually a Freak in Bed"}]}}}}