{"data":{"sitePage":{"id":"SitePage /","path":"/","context":{"centerpiece":{"abstract":"<p>Penn men’s basketball defeated Columbia by a score of 76-67 on Saturday afternoon. While the Red and Blue beat the Lions by nine points, it was a close game throughout, with the Quakers pulling away in the last few minutes.&nbsp;</p>","content":"<p>NEW YORK — The Quakers seem to have a knack for winning close games.&nbsp;</p>\n<p>Penn men’s basketball defeated Columbia by a score of 76-67 on Saturday afternoon. While the Red and Blue (11-7, 3-2 Ivy) beat the Lions (6-15, 1-4) by nine points, it was a close game throughout, with the Quakers pulling away in the last few minutes.&nbsp;</p>\n<p>The most notable moment of the game might have come in the middle of the second half, when senior guard Ryan Betley suffered an injury around his left ankle. It is too early to know his timetable for recovery, but the injury could be a major blow for the Quakers if it takes him off the court long-term. Betley has been enjoying an impressive season after suffering a season-ending injury in the first game of the 2018-19 season.&nbsp;</p>\n<p>With Betley off the court, the Quakers were able to find success in a tight late-game situation. Senior forward AJ Brodeur was the focal point of their offensive attack, leading both teams with 24 points. While Penn’s offense has flowed through Brodeur for years, the Quakers needed to rely even more on him and senior guard Devon Goodman, who scored 16 points, in Betley's absence.&nbsp;</p>\n<p>”They‘ve &nbsp;both been through us without this thing… and they’re just so committed to winning,” said coach Steve Donahue. “They do it every day, they don’t miss practices, they’ll do whatever is asked. Both guys are confident to make plays down the stretch, and we’re going to miss them [when they graduate]. They’re everything you want in a Penn basketball player.”</p>\n<p>The strong chemistry between the two seniors was exemplified throughout the game, as Brodeur found Goodman for several wide-open layups on cuts to the basket throughout the contest, which powered the Red and Blue's offense and allowed them to fend off a hungry Columbia team coming off four straight losses.&nbsp;</p>\n<p>“We’re in the same class and we’ve been friends since we got here, I think that we as a whole team,“ said Brodeur. “He’s our point guard, we trust him completely. You always know what to expect from him.“</p>\n<p>The first half was very much a back and forth fight, with neither team ever taking a double-digit lead. At halftime, both teams entered the locker rooms having scored 31 points.&nbsp;</p>\n<p>After the Quakers went up by 10 points at one point in the second half, the Lions got within one point with only a few minutes remaining before Penn put them away.&nbsp;</p>\n<p>Throughout the game, Columbia employed an up-tempo offense with quick ball movement and frequently attempted mid-range jump shots. This style of play was markedly different from Penn’s, which almost exclusively takes three-pointers and shots inside the paint.&nbsp;</p>\n<p>The Lions gave the Quakers a heavy dose of senior guard Mike Smith. Although he finished with a team-high 21 points, the Quakers’ defense was able to hold him relatively in check, as he shot just 36.4% from the field for the game.</p>\n<p>“I thought we made him a volume scorer, that’s all you can do with a kid who has the ball in his hands that much,” Donahue said.&nbsp;</p>\n<p>After being out of the lineup for a few games earlier this season, junior guard Eddie Scott has begun to contribute heavily in the Quakers’ recent wins. That was no different on Saturday, as he provided a spark off the bench with eight points on 4-of-4 shooting. During one sequence in the second half, he recorded two breakaway dunks in the span of about 10 seconds, the second a double-clutch slam that ignited the Penn fans in attendance and forced Columbia to call a timeout.&nbsp;</p>\n<p>The biggest highlight of the game, however, was when freshman guard Jordan Dingle connected with AJ Brodeur for a fast-break alley-oop dunk. The play helped fuel a second half resurgence that ultimately won Penn the game.</p>\n<p>“I saw their center at the top of the key just holding the ball and not paying attention to who was behind him, so I figured I’d just go ahead and tap it out of his hands from behind the back,” Scott said of the second dunk. “I was just trying to get my team hyped, yell at my team, yell at the crowd, and just give us that energy that we needed.”</p>\n<p>Even though this game was played 88 miles from the Palestra, the Penn fans in attendance made sure their voices were heard. In a city where many Penn students work after graduation, the alumni presence was strong in Levien Gymnasium.&nbsp;</p>\n<p>The game was originally scheduled for Friday at 7 p.m. but was postponed to Saturday due to inclement weather in upstate New York that affected Cornell and forced the Ivy League to reschedule four games. As a result, Penn will play a rare Sunday Ivy League game against the Big Red (5-13, 2-3 Ivy) in Ithaca, N.Y., where they will look to stay hot against a competitive Cornell team.&nbsp;</p>","dominantMedia":{"content":"","attachment_uuid":"b31a361b-6a31-4165-9300-62c6ccd270be"},"headline":"Penn men's basketball defeats Columbia, 76-67, in tight Saturday afternoon contest","subhead":"Senior Ryan Betley went down with an apparent ankle injury in the second half"}}}}}