{"data":{"sitePage":{"id":"SitePage /","path":"/","context":{"centerpiece":{"abstract":"<p>In their first home game in nearly a month, the Red and Blue hung on Friday night to defeat Columbia in overtime by a score of 86-84.</p>","content":"<p>It wasn't easy by any means, but Penn women's basketball earned a big W in its return to the Palestra.</p>\n<p>Led by junior center Eleah Parker's double-double, the Red and Blue hung on Friday night to defeat Columbia in overtime by a score of 86-84.&nbsp;</p>\n<p>In the team's first home game in nearly a month, Parker paced the Quakers (12-5, 2-2 Ivy) with a season-high 28 points, adding 13 boards. Freshman guard Kayla Padilla also had a big night, with 21 points of her own and a team-high three makes from distance.</p>\n<p>\"Both teams executed really well at critical times, particularly our group, I was really proud of them,\" coach Mike McLaughlin said. \"We spent a lot of time this week on certain parts of the game, and they were confident when that happened.\"</p>\n<p>Columbia star freshman Abbey Hsu led a valiant effort to keep the Lions (11-7, 2-3) constantly within striking distance, matching Parker's total of 28 points and going 6-of-9 from deep. Sophomore Sienna Durr also had a strong outing, posting 16 points and 15 rebounds for the visitors.</p>\n<p>The two teams were never separated by more than 10 points, and both picked up steam as the game went on. After a back-and-forth first 20 minutes, Penn took an eight-point lead into the half at 37-29.</p>\n<p>Parker just missed out on a career-high in points, but Friday night was special for her in another way. Midway through the third quarter, the junior eclipsed the 1,000-point mark in her career, becoming just the 23rd player in program history to do so.</p>\n<p>\"It's funny because Coach was getting on me in the timeout and then I heard it in the background and I was like 'Wow!', but it's amazing and I feel honored to be a part of the group that's reached that milestone,\" Parker said.</p>\n<p>Ignoring the fanfare, Columbia stayed focused on the game and steadily trimmed the lead behind 11 third-quarter points from Hsu. The Lions then exploded for 25 points in the fourth quarter to fully eliminate the deficit.</p>\n<p>Every time the Quakers rallied and came up with a clutch play down the wire, the visitors would have an response. A pair of late Parker and-one layups were coolly answered with sharp jumpers from the Lions, and the teams could not be separated after 40 minutes of play, heading into overtime tied at 75 all.</p>\n<p>But a solid extra five minutes from the Red and Blue, combined with Hsu fouling out, was enough for Penn to pick up the victory by the slimmest of margins.</p>\n<img class=\"media-embed\" data-embedded-media=\"6fabb361-7569-4489-a28e-20034b4c915e\" data-uuid=\"6fabb361-7569-4489-a28e-20034b4c915e\" data-link-to=\"\" src=\"https://s3.amazonaws.com/snwceomedia/dpn/ee6cdcbe-eeea-4122-9156-3f6f835e2931.sized-1000x1000.jpg\" data-width=\"563.96875\" data-height=\"375.875\" data-align=\"\" />\n<p>Padilla powered the Quakers in overtime, scoring eight of the team's 11 points post-regulation. When the pressure was dialed up, the rookie delivered.</p>\n<p>\"I think the team is built for these kinds of moments,\" Padilla said. \"We went through a lot of adversity in January and I think we learned a lot of lessons and I think that really carried over to this game.\"</p>\n<p>Overall, it was Penn's depth and clean play that allowed it to come out on top. In addition to Parker and Padilla — who combined for 49 of the Quakers' 86 points — junior forward Tori Crawford and senior guard Phoebe Sterba also reached double figures, adding 13 and 12 points, respectively.</p>\n<p>None of the Red and Blue's players picked up more than three fouls, and having only 10 turnovers — compared to Columbia's 16&nbsp;— may have made all the difference.</p>\n<p>The Quakers don't have too much time to enjoy the exciting win, as they turn around to face Cornell Saturday night. With the other New York Ivy coming off a 60-29 loss to Princeton on Friday, Penn will look to keep the Big Red's offense to a minimum for the second straight night.</p>","dominantMedia":{"content":"<p>Junior center Eleah Parker notched 28 points and 13 rebounds on Friday night, joining the 1,000-point club in the process.</p>","attachment_uuid":"0ab1b40a-2212-44a9-ac73-18f0dfe36f83"},"headline":"Parker reaches 1,000 points as Penn women's basketball survives against Columbia","subhead":"Eleah Parker and Kayla Padilla combined for 49 of Penn's 86 points"}}}}}