{"data":{"sitePage":{"id":"SitePage /","path":"/","context":{"centerpiece":{"abstract":"<p>Penn follows a “work hard, play hard” social schedule. But taking in a basketball game at the Palestra? For most, that's just not the way they want to play.</p>","content":"<p>It’s a Saturday night at the beginning of February, and only 30 minutes remain until tip-off for a Penn men’s basketball game against Ivy League rival Dartmouth. Coming off big wins against Harvard and Temple, one would think the student body would be lining up to get inside the <a href=\"https://www.usatoday.com/story/sports/ncaab/2017/02/06/college-basketball-cathedral-the-palestra-celebrates-90-years/97561946/\" target=\"_blank\">Cathedral of College Basketball</a>.</p>\n<p>But with the action just minutes away, the student section is so empty that there is still time to snag a coveted courtside seat. While there are currently more student-athletes warming up on the basketball court than there are students in the stands, the general attendance sections are beginning to fill up.&nbsp;</p>\n<p>Many alumni have come back to visit their alma mater, some with children, to take in the game. Countless gray-haired supporters, hoping for a return to their glory days, also dot the home section. Two men wearing “Class of ‘72\" sweatshirts and sporting wrinkles each buy a box of popcorn and take their seats near half court.&nbsp;</p>\n<p>But something is different about the Palestra than when these two were students.</p>\n<p>As more time passes, the opening tip is moments away. The student section is now around 40% full, but that number doesn’t tell the whole story.&nbsp;</p>\n<p>The area designated for current undergraduates is not completely composed of average students. Many other Penn athletes have come in groups to support the team. There are even some who have snuck in that look much too old to be students.</p>\n<p>The Quakers dominate the Big Green as play begins, coasting into halftime with a 28-14 lead. With plenty of big plays so far, the crowd is constantly applauding. But the student section lacks a certain energy.</p>\n<p>Even though it has been an exciting game to watch, the Penn students who have shown up have remained in their seats the entire time. Every highlight-reel dunk or steal is met with soft applause — not the overwhelmingly loud cheers that are associated with basketball student sections across the country.&nbsp;</p>\n<img class=\"media-embed\" data-embedded-media=\"1f72aacb-af0f-4b02-b78d-fbf7fc01b0fb\" data-uuid=\"1f72aacb-af0f-4b02-b78d-fbf7fc01b0fb\" data-link-to=\"\" src=\"https://s3.amazonaws.com/snwceomedia/dpn/b29087d1-3b09-4a9d-8412-d16f443382f1.sized-1000x1000.jpg\" data-width=\"0\" data-height=\"0\" data-align=\"\" />\n<p>On a night when the Quakers would go on to fight off a Dartmouth comeback and further establish themselves as an Ivy League Tournament contender, the student section's biggest reaction of the night very well may have been when a fellow student finally won the infamous layup, free-throw, and three-point contest played during a timeout.</p>\n<p>This is a familiar scene as of late at the Palestra. Two weeks earlier, Big 5 rival Saint Joseph’s made the trip across town, and so did its fans. While Penn’s student section was slightly fuller for that game than it was against Dartmouth, St. Joe’s fans often roared louder than the students wearing red and blue.&nbsp;</p>\n<p>Game-day scenes like these signal that the culture surrounding basketball at Penn is not the same as it was during the Quakers’ basketball heyday.&nbsp;</p>\n<p>***</p>\n<p>Why does the Palestra, commonly referred to as the Cathedral of College Basketball<strong>, </strong>routinely struggle to fill its 8,722-seat capacity?</p>\n<p>After all, the history of college basketball cannot be written without Penn. In addition to competing against historic Ancient Eight rivals on a weekly basis, the Quakers also compete in Philadelphia’s Big 5, a yearly round-robin that determines the city’s best team. The Palestra is recognized as an integral part of college basketball’s history and inception.</p>\n<p>Penn prides itself on having a diverse student body with differing interests, but discussions with many students showed that their reasons for not attending games were mostly the same.&nbsp;</p>\n<p>As an Ivy League school, Penn carries an identity as an academically rigorous institution, where students are often consumed by their studies and extracurricular commitments. Undergraduates often find themselves moving from class to class during the day only to attend several club meetings later that night.&nbsp;</p>\n<p>Perhaps the simplest explanation behind declining student attendance at Penn games is that students just don’t have the time.&nbsp;The Daily Pennsylvanian talked to students in order to find out exactly why attendance is not what it once was.&nbsp;</p>\n<p>“A lot of times, I have a lot of work and may only have an hour,” Wharton senior Trista Vatavuk said. “Depending on the weekend, you do have a lot of work, so it’s not even like you get to choose other social things over basketball games.”</p>\n<p>This explanation proved to be consistent across schools, years, and backgrounds.&nbsp;</p>\n<p>“[It’s] mostly just me being busy. I do so much, so I don’t really go to anything that I don’t need to or that isn’t at the top of my priorities,” said Derek Nhieu, the president of the Class Board of 2023.</p>\n<img class=\"media-embed\" data-embedded-media=\"b51f45a2-c602-43ca-8c13-c48f4ea45c6e\" data-uuid=\"b51f45a2-c602-43ca-8c13-c48f4ea45c6e\" data-link-to=\"\" src=\"https://s3.amazonaws.com/snwceomedia/dpn/42826088-a6f0-4b21-9000-9452fcfb18dd.sized-1000x1000.jpg\" data-width=\"935.46252441406\" data-height=\"623.47503662109\" data-align=\"\" />\n<p>While it is easy to say that Penn students are just busy and always have been, the numbers tell a different story.</p>\n<p>The decline in attendance at Penn men’s basketball games is the result of a trend that has slowly evolved over the past two decades. According to the NCAA’s official data on college basketball attendance, the average attendance at a Penn home game from the late 1970s to the end of the 1990s was frequently around 5,000 people. In many cases, that number was closer to 5,500, and in some years it even exceeded that total.</p>\n<p>For that portion of Penn’s illustrious basketball history, Big 5 basketball was king in Philadelphia, and competition for the crown was strong every year. The Quakers were also consistently a top-two Ivy League team that turned NCAA tournament berths into the program’s new normal.</p>\n<p>Entering the 21st century, Penn men’s basketball continued to be a consistent, high-caliber program that competed at the national level. Attendance at the team’s games also seemed to have carried over its 20th century totals, as the average attendance in 2000 was a respectable 5,571 people.&nbsp;</p>\n<p>This trend did not last long, however, as the early 2000s brought along the start of the decline in attendance at the Palestra. Only five years after the Quakers played in front of an average of 5,571 people, the average attendance at Penn home basketball games fell to 4,620 in 2005, a year in which the team made the NCAA Tournament.</p>\n<p>This new trend continued throughout the rest of the 2000s and into the 2010s. In 2009, for the first time in decades, the average attendance at Penn home games was under 4,000 — 3,656, to be exact. At the same time, Penn began to lag on the court, as the team struggled to compete in the Big 5 and reach March Madness. A trip to face Kansas in 2018 ended an 11-year NCAA Tournament drought.&nbsp;</p>\n<img class=\"media-embed\" data-embedded-media=\"6c2b1eaf-6b20-4708-b90d-9f9aedc68b83\" data-uuid=\"6c2b1eaf-6b20-4708-b90d-9f9aedc68b83\" data-link-to=\"\" src=\"https://s3.amazonaws.com/snwceomedia/dpn/1bd1cbc0-eca4-4d36-a1c6-5fa04e629d53.sized-1000x1000.png\" data-width=\"0\" data-height=\"0\" data-align=\"\" />\n<p>“I hope we get back to the NCAA Tournament, because I have friends who go to Duke, and they have much more fun [at games] than I would,” College sophomore Michael Hua said.</p>\n<p>While student attendance has been on a steady decline for decades, alumni support of the program has remained strong even as the Quakers struggle to return to the level they were at in the 1980s. Through their strong attendance, Penn alumni have clearly demonstrated that they are more passionate about Penn Athletics than current students.&nbsp;</p>\n<p>When most students arrive on campus, their knowledge about Penn basketball, as well as their interest in the sport, is limited.&nbsp;</p>\n<p>“I understood we had a rivalry with Princeton, and I understood the Palestra, and I knew about the Big 5,” College sophomore Jaden Cloobeck said. “But that was something I picked up at Penn. When I was first applying to Penn, I did not [know] anything about the basketball team specifically.”</p>\n<p>In some cases, the disconnect between students and Penn Athletics is even greater.&nbsp;</p>\n<p>“Thank you for enlightening me on the fact that we even have a basketball team,” Wharton freshman Sukanya Kennamthiang said when asked if she had been to a Penn basketball game.</p>\n<p>For certain selective schools, college basketball is king. Villanova and Duke are nationally known as both academic and athletic powerhouses with competitive admissions. In fact, Villanova routinely experiences a surge in applications following its NCAA Tournament successes. At these schools, student social life revolves around when and where games are being played.&nbsp;</p>\n<p>At universities like Villanova, it is commonplace for students to enter competitive raffles just to secure a seat. On the other hand, at Penn, students are incentivized by rewards and promotions just to get them in the door.&nbsp;</p>\n<p>Before Penn’s recent game against Big 5 rival Temple, students in attendance were eligible for the chance to make a $10,000 half-court shot. This promotion is just one of many, as Penn Athletics also uses the Penn Rewards app that offers students a chance to earn points for attending sporting events. These points then make students eligible for a variety of prizes.&nbsp;</p>\n<p>Not only are students at schools like Villanova committed during games, but they are also committed to pre and post-game activities. Taking these activities into account, students at these schools are often blocking out nearly five hours for a single game. Although Penn and its associated activities consume much of its students’ time, there is little reason to believe that students at Villanova or Duke are significantly less busy.&nbsp;</p>\n<p>These similarities suggest that if Duke and Villanova students can give up an entire night for a basketball game, Penn students should have the time to at least walk in the doors.&nbsp;</p>\n<img class=\"media-embed\" data-embedded-media=\"9351f045-86bd-470a-b4ae-575a68d2faa1\" data-uuid=\"9351f045-86bd-470a-b4ae-575a68d2faa1\" data-link-to=\"\" src=\"https://s3.amazonaws.com/snwceomedia/dpn/ed0e0e6b-cd2b-4757-8fbf-b4d94867ae2a.sized-1000x1000.jpg\" data-width=\"935.46252441406\" data-height=\"623.47503662109\" data-align=\"\" />\n<p>Thus, there must be a deeper explanation for Penn’s declining attendance — culture.</p>\n<p>While many students cite time constraints as their reason for not attending games, this may not be entirely accurate. Penn is widely known as the “Social Ivy,” a reputation that it has earned in large part as a result of the strong Greek life presence on campus, as well as many other social clubs and events.&nbsp;</p>\n<p>While most Penn students do have time for social events, they would rather attend a BYO, go to a frat party, or even stay in than go to a Penn basketball game. With the average college basketball game running two hours long, many students simply prefer their social events to be a bit shorter.&nbsp;</p>\n<p>“That’s the thing about basketball games. They are pretty long, so I feel like it’s hard to commit to those few hours when I can just go to dinner with a friend for 45 minutes,” Vatavuk said.</p>\n<p>While most students have trouble making time for games, some have found unconventional reasons to go.&nbsp;</p>\n<p>“I’ve found the rewards app really cool; I decided I want to get all the awards. I saw after 5,000 points you get a watch, so I’ve been going to a bunch of different sporting events,\" Wharton freshman Carson Sheumaker said.&nbsp;</p>\n<p>Even though there is a contingent of students who faithfully attend games, many reported that they have a tough time getting others to join them.</p>\n<p>\"I have frequently tried to bring friends to games. Sometimes it works; many times it doesn’t work,\" Sheumaker said.&nbsp;</p>\n<p>As opposed to other schools where many students’ social lives revolve around the basketball schedule, at Penn, basketball games are generally not seen as viable social events.&nbsp;</p>\n<p>“When I was in high school, going to games was a tradition, but I feel like at Penn going to games is not a tradition,” Cloobeck said. “This is more about how we work hard, and we play hard, and we choose how we want to play.”</p>\n<p>Some students noted that the Palestra is too far of a walk for them to consistently attend games. While the arena can be nearly a mile away for students who live off campus, this is hard to believe as well, as many students are known to frequently travel much farther to Center City for various social gatherings.&nbsp;</p>\n<p>“Friday is a day to catch up with people I don’t get to see as much during the week, and I think ideally we wouldn’t go to a basketball game,” Wharton sophomore Merrick Eng said. “We would probably go somewhere else that is more chill.”</p>\n<p>If there is one overarching theme, it is that the decline in attendance at Penn basketball games comes from a culture issue that stems from student perception of what is important.&nbsp;</p>\n<p>There is no doubt that Penn students spend their weeks hitting the books and let loose on the weekend — the school follows a “work hard, play hard” social schedule.&nbsp;</p>\n<p>But taking in a basketball game at the Palestra? For most, that's just not the way they want to play.</p>","dominantMedia":{"content":"","attachment_uuid":"ce8c0c87-1e96-47eb-9be1-fb76958134b7"},"subhead":"Apathy towards school sports culture is a major factor","headline":"An empty cathedral: Why aren't more students attending basketball games at the Palestra?"},"topArticles":[{"abstract":"<p>When asked by Daily Pennsylvanian reporters what she would say to on-campus college voters, Warren stressed the need for \"an America that works for everyone.\"</p>","content":"<p>LEBANON, N.H. – Former Penn Law School professor and Democratic presidential hopeful Sen. Elizabeth Warren (D-Mass.) hosted a town hall for around 500 people on Sunday night in New Hampshire.</p>\n<p>In the heart of the action leading up to the nation's first Democratic primary election, Warren called for “big structural change.”</p>\n<p>When asked by Daily Pennsylvanian reporters what she would say to on-campus college voters, Warren stressed the need for \"an America that works for everyone.\"</p>\n<p>\"Who the government works for has got to be the central question that will determine your future,\" Warren told the DP. \"If we stay on this current path of government working great for giant corporations, for billionaires, and for lobbyists, then your future – unless you are a billionaire, a giant corporation, or a lobbyist – is going to be in real trouble.\"</p>\n<p>Warren detailed her plans to combat corruption, climate change, and alleviate issues that affect working class Americans in front of a crowd of mostly older families with children. There were a handful of college students in attendance, including several from nearby Dartmouth College and Philadelphia's Temple University.</p>\n<p>In her speech, Warren also criticized the recent impeachment trial, calling it \"a sham trial with no evidence.\"</p>\n<img class=\"media-embed\" data-embedded-media=\"e56f79dd-d37e-4723-a715-7a689f61344b\" data-uuid=\"e56f79dd-d37e-4723-a715-7a689f61344b\" data-link-to=\"\" src=\"https://s3.amazonaws.com/snwceomedia/dpn/7c87f9de-20e5-40bf-8567-9e6884c0227d.sized-1000x1000.jpg\" data-width=\"788.40625\" data-height=\"525.46875\" data-align=\"\" />\n<p>During the Q&amp;A session of the town hall, Warren compared current Vice President Mike Pence to a loyal pet. An audience member asked the Senator whether she discusses her own potential vice presidential picks with her dog, Bailey, who was present at the town hall.&nbsp;</p>\n<p>\"Do you whisper into Bailey's ear, 'Who is going to be my Mike Pence? Who’s going to look at me with adoring eyes?'\" a man in audience asked.</p>\n<p>Warren cut off the man and said, \"Oh, I already have a dog,\" followed by laughter and cheers from the crowd.&nbsp;</p>\n<p>Dartmouth sophomore Izzy Glennon said she remains undecided about which Democratic candidate will get her vote. But she said she was glad to attend the event, especially due to its proximity to Dartmouth's campus.&nbsp;</p>\n<p>“I think it is important just to take advantage of this opportunity, being up here and having such easy access, especially being a student and all this being free,\" Glennon said.&nbsp;</p>\n<div class=\"embed\"><style>.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }</style><div class='embed-container'><iframe src='https://www.youtube.com/embed//x1_HfqWK4a4' frameborder='0' allowfullscreen></iframe></div></div>\n<p>Temple seniors Katherine Weaver and Andrea Salas were at Warren's town hall covering the event for their college newspaper. They stressed the importance of the youth vote in the upcoming presidential election.</p>\n<p>\"I know they say that all the time, but there really is a lot at stake [in the presidential election],\" Weaver said. \"I think students should be aware because this [presidential election] is going to affect us more than it is any other voters.\"&nbsp;</p>\n<p>Salas echoed Weaver, adding she feels her age group is not always represented at the polls.&nbsp;</p>\n<p>\"People who get involved in politics are usually older people because they have the time to watch the news and get politically involved.\" Salas said. \"In order for issues that affect us to really be addressed, more college students need to get out there and vote — especially women.\"&nbsp;</p>\n<p>Currently, Warren is <a href=\"https://www.realclearpolitics.com/epolls/2020/president/nh/new_hampshire_democratic_presidential_primary-6276.html\" target=\"_blank\">polling third in the RealClearPolitics polling average of New Hampshire</a>, behind both Sen. Bernie Sanders (I-Vt.) and former Mayor Pete Buttigieg of South Bend, Ind.</p>\n<p>Before her current position in the Senate, Warren was a longtime law professor, teaching at Penn Law between 1987 and 1995. According to recent interviews with the DP, both <a href=\"https://www.thedp.com/article/2019/01/elizabeth-warren-president-penn-law-professor-students\" target=\"_blank\">students</a> and <a href=\"https://www.thedp.com/article/2019/01/elizabeth-warren-president-penn-law-2020-democrat\" target=\"_blank\">faculty</a> who knew Warren held her in high esteem. &nbsp;</p>","dominantMedia":{"attachment_uuid":"46bf5aa2-f760-4431-b0b6-e6d4ede26479","content":""},"headline":"Former Penn prof. Elizabeth Warren tells the DP America needs to work for everyone"},{"abstract":"<p>Penn for Bernie joined a group of around 40 students in New Hampshire and returned to Philadelphia Sunday night. Four Biden supporters from Penn also canvassed throughout the state.</p>","content":"<p>DOVER, N.H. — Braving sub-zero temperatures, remote rural roads, and strangers behind doors, undergraduate students from Penn for Bernie and Penn for Biden trekked from Philadelphia to New Hampshire to canvass for their candidates.</p>\n<p>Just days before Tuesday's first-in-the-nation Democratic primary, Penn students aimed to make their mark on the race for the White House and knocked on hundreds of doors throughout the Granite State.</p>\n<p>Penn for Bernie, joined by Philly for Bernie, Drexel for Bernie, and Rowan for Bernie, arrived in New Hampshire on Friday night with a group of approximately 40 students and returned to Philadelphia Sunday night.&nbsp;</p>\n<p>Four Biden supporters from Penn canvassed in different parts of the state, including College junior Ben May, who left campus this semester to work full-time on the Biden campaign. May and Biden campaign regional fellow and Engineering sophomore Ronak Bhagia plan to continue canvassing up until Tuesday’s election.</p>\n<p>The large group of Sanders supporters mirrored the enthusiasm for the Vermont senator in the polls, where Sanders <a href=\"https://www.realclearpolitics.com/epolls/2020/president/nh/new_hampshire_democratic_presidential_primary-6276.html\" target=\"_blank\">enjoys the lead in the RealClearPolitics polling average</a>. Biden, once seen as the front-runner in the race, is a distant fourth in the polling average — sitting more than ten percentage points behind Sanders.</p>\n<p>Bhagia, the Biden supporter, said he and the other volunteers received three or four packets each day with lists of potential voters. The packets contain approximately 30 to 40 addresses of 70 to 100 prospective voters in a certain neighborhood. For each house Bhagia visits, he writes down whether or not someone answers the door and, if they answer, if he thinks the person is likely vote for Biden.</p>\n<p>Bhagia said some issues he faced while canvassing occurred because his car could not handle the harsh New Hampshire climate. A snowstorm hit the state <a href=\"https://www.usnews.com/news/best-states/new-hampshire/articles/2020-02-07/vermont-new-hampshire-and-maine-bracing-as-storm-hits\" target=\"_blank\">on Friday</a>, knocking out power in thousands of homes. Numerous trees and telephone poles collapsed. His car nearly got stuck on a remote, rural road.</p>\n<div class=\"embed\"><style>.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; }</style><div class='embed-container'><iframe src='https://albumizr.com/a/xrQH' scrolling='no' frameborder='0' allowfullscreen width='700' height='400'></iframe></div></div>\n<p>\"I'm completely stuck in this dirt road, my phone's at about five percent, there is no house anywhere to be found near me,\" he said. \"It is about 13 degrees Fahrenheit and I was not nearly dressed well enough for it, so for a while I was like, this is about to be rough.\"</p>\n<p>After shoving sticks and leaves under the tires, Bhagia was able to keep going.</p>\n<p>Though canvassing can be tedious – and even dangerous – he believes it is vital for voter turnout, especially in the few days before the primary.&nbsp;</p>\n<p>“For every 100 people you canvass, you’re going to get 10 that are going to go to the polls that wouldn’t have otherwise,\" he said.&nbsp;</p>\n<p>Penn for Bernie canvassers used an app known as MiniVAN, which College sophomore and Penn for Bernie president Jack Cahill said is popular among Democratic campaigns. The app consolidates a database of eligible voters in specific areas. Canvassers then record each voter's reaction towards Sanders in the app, ranging from \"strong support\" to \"hostile.\"</p>\n<p>\"We’ve pretty much just been knocking on doors and making sure people are planning to go out and be voting in their primary – it’s all about turnout,\" Cahill said. \"A lot of people we’ve been talking to are undecided or even leaning to the right.\"</p>\n<p>According to Cahill, students from Penn, Drexel, Rowan, and Philly for Bernie knocked on 2,000 doors total in Rochester and Dover throughout the weekend. College sophomore and Penn for Bernie co-director Amira Chowdhury said their team is optimistic Sanders has the majority of voters in New Hampshire.&nbsp;</p>\n<p>Cahill stressed that their job is not just to campaign for Sanders, but to inspire people to vote, despite obstacles like misinformation, disenfranchisement, and physical disabilities.&nbsp;</p>\n<p>\"The issue is just a matter of turnout and getting them to the polls, given that there are so many barriers to voting here in this country,\" he said.&nbsp;</p>","dominantMedia":{"attachment_uuid":"f3ee67c6-034a-4478-ba23-50d0fd308933","content":""},"headline":"Penn for Bernie and Penn for Biden trek hundreds of miles to canvass for N.H. primary"},{"abstract":"<p>The six-week program consists of workshops conducted by Counseling and Psychological Services, Alcohol and Other Drug Program Initiatives, Campus Health, and Men Against Rape and Sexual Assault for new members before being officially initiated into their chapter.</p>","content":"<p>The Interfraternity Council has increased attendance mandates and number of required workshops for the New Member Education program after <a href=\"https://www.thedp.com/article/2017/09/only-five-out-of-penns-27-fraternities-completed-ifc-mandated-education-programs\" target=\"_blank\">years of low turnout among fraternity members</a>.</p>\n<p>The <a href=\"https://www.vpul.upenn.edu/ofsl/joining.php\" target=\"_blank\">six-week program</a> consists of four required workshops conducted by Counseling and Psychological Services, Alcohol and Other Drug Program Initiatives, Campus Health, and Men Against Rape and Sexual Assault for new members before being officially initiated into their chapter, IFC President and College junior Louis Galarowicz said. This will be the first year at least 80 percent of new members in each fraternity will be required to attend the AOD and CAPS sessions, Galarowicz added.</p>\n<p>Galarowicz, a member of Sigma Alpha Epsilon, added all new members must also attend a workshop at their chapter house facilitated by MARS.</p>\n<p>Last year, IFC <a href=\"https://www.thedp.com/article/2019/02/upenn-ifc-fraternity-rush-new-member-education-recruitment\" target=\"_blank\">required</a> all new members to attend the MARS workshop but did not have a specific attendance mandate for the workshops hosted by CAPS, Campus Health, and AOD from which each chapter picked two to attend.</p>\n<p>The changes to the NME program were made to ensure more new members attend the workshops and create a more effective conversation about these issues, Galarowicz said.</p>\n<p>“We’re trying to target the issues we face in the most broad-based way,\" Galarowicz said. \"Conceptions of masculinity are tied to cultures of violence, conceptions of self, or substance abuse.\"</p>\n<p>He added that he benefited from attending NME workshops as a first–year and hopes more students will take advantage of these opportunities. &nbsp;&nbsp;</p>\n<p>“It was always the kids who weren’t athletes, the kids who weren’t involved in other stuff who got saddled with a lot of the programs [in the past],” he said.</p>\n<img class=\"media-embed\" data-embedded-media=\"ed613ce1-d5e6-454d-89d3-66e525d2541b\" data-uuid=\"ed613ce1-d5e6-454d-89d3-66e525d2541b\" data-link-to=\"\" src=\"https://s3.amazonaws.com/snwceomedia/dpn/684b0fb4-3a86-4dee-a68f-5c9f945ff4c1.sized-1000x1000.jpeg\" data-width=\"788.40625\" data-height=\"644.90625\" data-align=\"\" />\n<p>Penn Chief Wellness Officer Benoit Dubé said he credits the IFC for reaching out to CAPS to better streamline NME and achieve higher turnout.</p>\n<p>The IFC has<a href=\"https://www.thedp.com/article/2019/02/upenn-ifc-fraternity-rush-new-member-education-recruitment\" target=\"_blank\"> tried several strategies</a> in the past three years<strong> </strong>to increase turnout at NME events. In 2017, <a href=\"https://www.thedp.com/article/2017/09/only-five-out-of-penns-27-fraternities-completed-ifc-mandated-education-programs\" target=\"_blank\">only five of Penn’s 27 fraternities</a> met then-mandated IFC attendance requirements which included a sex education workshop, MARS workshop, and the Vagina Monologues. In 2018, the IFC hoped more flexibility would boost turnout by having fraternities choose only three programs to attend from nine options. The IFC adopted a stricter stance in 2019 by making the MARS workshop compulsory and threatening to <a href=\"https://www.thedp.com/article/2019/02/upenn-ifc-fraternity-rush-new-member-education-recruitment\" target=\"_blank\">block initiation of new members</a> until they attended the required events.</p>\n<p>“There’s a lot of research that supports the fact that too many choices is overwhelming and can be a negative,” Director of Campus Health Ashlee Halbritter said in support of the IFC’s streamlining efforts.</p>\n<p>Campus Health will also hold its annual sex education workshop, known as “sex camp,” as part of new member training for both sororities and fraternities. Galarowicz said that at least four new members from each fraternity are required to attend the \"sex camp\" compared to last year's three.&nbsp;</p>\n<p>Halbritter said that attendance requirements for the \"sex camp\" is lower than the CAPS, AOD, and MARS workshops because of space and time constraints. Halbritter added that Campus Health will offer an online equivalent for those who do not attend the camp.</p>\n<p>Delta Tau Delta President and College junior Matthew Garber said that the new IFC requirements will not mean a significant change for his chapter.</p>\n<p>“[Delta Tau Delta] has always had a CAPS presentation, MARS, Penn Anti-Violence Educators,\" Garber said. \"We’ve been doing these since as long as I’ve been in the fraternity.\"</p>\n<p>According to <a href=\"https://www.thedp.com/article/2017/09/only-five-out-of-penns-27-fraternities-completed-ifc-mandated-education-programs\" target=\"_blank\">figures from 2017</a>, Delta Tau Delta met the NME attendance requirements for Campus Health and MARS events but did not meet the then-mandated Vagina Monologues requirement.&nbsp;</p>\n<p>Garber, however, welcomed the IFC’s initiative to increase fraternity turnout at NME, adding that the Greek life community tends to face negative repercussions collectively.</p>\n<p>\"[Galarowicz] really set the tone and has taken charge of this and made it simpler so that it doesn't feel like yet another chore but something that’s important and that brings people together through unified values, namely inclusivity and education,\" Dubé said.</p>","dominantMedia":{"attachment_uuid":"4b851834-f808-4c4b-bcea-9ad7161fc73a","content":"<p>All new fraternity members must attend a workshop at their chapter house facilitated by MARS.</p>"},"headline":"IFC increases its education program's attendance requirements for new fraternity members"}],"mostReadDP":[{"path":"/article/2020/02/coronavirus-wuhan-penn-students-travel-trump-ban","image":"https://snworksceo.imgix.net/dpn/b032b62a-36b1-446d-9a11-8e0d35230862.sized-1000x1000.png?w=800","ogTitle":"Penn student stranded in Wuhan says coronavirus outbreak is &#39;like a zombie apocalypse&#39;"},{"path":"/article/2020/02/upenn-bernie-sanders-2020-politics-daily-pennsylvanian","image":"https://snworksceo.imgix.net/dpn/d851148b-a33d-4799-93d5-2295fb309ab6.sized-1000x1000.jpg?w=800","ogTitle":"Editorial | Bernie Sanders is the best candidate to defeat Trump"},{"path":"/article/2020/02/penn-iaa-model-un-osa-shut-down","image":"https://snworksceo.imgix.net/dpn/9e04021b-0361-43e4-87fa-5e4ed8a5f9c9.sized-1000x1000.png?w=800","ogTitle":"International Affairs Association suspended, loses registration with Penn"},{"path":"/article/2020/02/penn-volleyball-what-we-know-and-dont-know","image":"https://snworksceo.imgix.net/dpn/d9b738c6-fef9-4758-8fee-7392b5fffa8c.sized-1000x1000.jpg?w=800","ogTitle":"What we know and what we don&#39;t know about the state of Penn volleyball"},{"path":"/article/2020/02/palestra-penn-mens-basketball-attendance-student-culture-ivy-league","image":"https://snworksceo.imgix.net/dpn/ce8c0c87-1e96-47eb-9be1-fb76958134b7.sized-1000x1000.jpg?w=800","ogTitle":"An empty cathedral&#58; Why aren&#39;t more students attending basketball games at the Palestra&#63;"}],"mostRead34":[{"path":"/article/2020/02/sophie-shen-artist-paint-watercolor-sydney-australia-etsy-custom-shoes-jackets-textiles-graphic-design-student-wharton","image":"https://snworksceo.imgix.net/dpn-34s/8587d08b-d4b2-4148-b4c3-b91ed67a1552.sized-1000x1000.JPG?w=800","ogTitle":"Meet Sophie Shen, the Wharton Sophomore Who Will Paint on Anything"},{"path":"/article/2020/02/tiktok-austin-maguire-social-media-vine-upenn-ivy-league","image":"https://snworksceo.imgix.net/dpn-34s/85d4041d-726f-4050-ad7d-e0519f2f5f50.sized-1000x1000.jpg?w=800","ogTitle":"Austin Maguire on the highs and lows of TikTok stardom"},{"path":"/article/2020/02/toni-rinaldi-glee-club-gettysburg-upenn-ivy-league-ego-of-the-week","image":"https://snworksceo.imgix.net/dpn-34s/bde83b97-6f48-48d4-9e27-96977e90c632.sized-1000x1000.png?w=800","ogTitle":"Ego of the Week&#58; Toni Rinaldi"}],"mostReadUTB":[{"path":"/article/2020/02/penn-suspends-iaa-hazing","image":"https://snworksceo.imgix.net/dpn-utb/343c70c1-48ba-4d55-80fe-0c321fa56d6d.sized-1000x1000.jpg?w=800","ogTitle":"BREAKING&#58; Penn Finally Brings Down the IAA, the Only Group on Campus That Does Hazing of Any Kind "},{"path":"/article/2020/02/mckinsey-self-proclaimed-communist","image":"https://snworksceo.imgix.net/dpn-utb/d2329a88-eb23-430a-bc11-81b6dd85cf61.sized-1000x1000.jpg?w=800","ogTitle":"Meet the Self-Proclaimed Communist Working at McKinsey Next Year"},{"path":"/article/2020/02/girl-bullet-journals-daily-freak-bed","image":"https://snworksceo.imgix.net/dpn-utb/55d449ec-5c69-4e7a-8adf-00062e40a676.sized-1000x1000.jpg?w=800","ogTitle":"Girl Who Bullet Journals Daily Actually a Freak in Bed"}]}}}}